src/Catalogs/БЗ_КатегорииБазыЗнаний/БЗ_КатегорииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_КатегорииБазыЗнаний</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_Контрагент</name>
    <comment>Конкретное задание группы статей по контрагенту (заказчику)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказыватьДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющиеВопросыДляСтикера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_НоменклатураПоУмолчанию</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_ТекстДляДобавленияВЗадание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АйТи_ВзятьТекстИзСервисныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботыВРамкахИТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УровниКомпетенции</name>
    <attributes>
      <name>Требования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/БЗ_ИзбранноеБазыЗнаний/БЗ_ИзбранноеБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_ИзбранноеБазыЗнаний</name>
  <resources>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочее</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияБазыЗнаний</name>
    <type>
      <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/БЗ_ВидыНовостейБазыЗнаний/БЗ_ВидыНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БЗ_ВидыНовостейБазыЗнаний</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/БЗ_КатегорииБазыЗнаний/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

// ТипНовости: 1 - создание, 2 - изменение, 3 - удаление
Функция ДобавитьНовостьБазыЗнаний(ТипНовости)
	
	ТекПользователь		= Пользователи.ТекущийПользователь();
	
	ПараметрыСсылкиОтв	= Новый Структура("id", Строка(ТекПользователь.УникальныйИдентификатор()));
	АдресСсылкиОтв		= БЗ_БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("user", ПараметрыСсылкиОтв);
	
	ПараметрыСсылкиКат	= Новый Структура("id", Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	АдресСсылкиКат		= БЗ_БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("category", ПараметрыСсылкиКат);
	
	Если ТипНовости = 1 Тогда
		ВидНовости	= Перечисления.БЗ_ВидыНовостейБазыЗнаний.Создание;
		Заголовок	= "Новая категория '%3'";
		ТекстHTML	= "<div>%1 в %2 добавлена новая категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|	<br><a href='" + АдресСсылкиКат + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 3 Тогда
		ВидНовости	= Перечисления.БЗ_ВидыНовостейБазыЗнаний.Удаление;
		Заголовок	= "Удалена категория '%3'";
		ТекстHTML	= "<div>%1 в %2 удалена категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|</div>";
	КонецЕсли;
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДЛФ=DD"));
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДФ=HH:mm"));
	МассивПараметров.Добавить(СокрЛП(ЭтотОбъект.Наименование));
	МассивПараметров.Добавить(Строка(ТекПользователь));
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(Заголовок, МассивПараметров);
	ТекстHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ТекстHTML, МассивПараметров);
	
	ПараметрыНовости = Новый Структура;
	ПараметрыНовости.Вставить("Автор"				, ТекПользователь);
	ПараметрыНовости.Вставить("Заголовок"			, Заголовок);
	ПараметрыНовости.Вставить("ТекстHTML"			, ТекстHTML);
	ПараметрыНовости.Вставить("ОбъектБазыЗнаний"	, ЭтотОбъект.Ссылка);
	ПараметрыНовости.Вставить("Важность"			, 2);
	ПараметрыНовости.Вставить("ВидНовости"			, ВидНовости);
	
	БЗ_БазаЗнанийВызовСервера.ДобавитьНовость(ПараметрыНовости);
	
КонецФункции

Процедура ДобавитьКатегориюВИзбранное()
	
	МенеджерЗаписи = РегистрыСведений.БЗ_ИзбранноеБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Создание				= Истина;
	МенеджерЗаписи.Изменение			= Истина;
	МенеджерЗаписи.Удаление				= Истина;
	МенеджерЗаписи.Оповещение			= Истина;
	МенеджерЗаписи.Прочее				= Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииОбновления = Новый Массив;
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		КатегорииОбновления.Добавить(ЭтотОбъект.Родитель);
	КонецЕсли;
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		РодительСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Родитель");
		Если ЗначениеЗаполнено(РодительСсылка) Тогда
			КатегорииОбновления.Добавить(РодительСсылка);
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КатегорииОбновления", КатегорииОбновления);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КатегорииОбновления")
		И ТипЗнч(ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления) = Тип("Массив")
		И ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления.Количество() > 0 Тогда
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый Структура("Категории", ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления));
		
		ФоновыеЗадания.Выполнить(
			"БЗ_БазаЗнаний.ОбновитьСтатистикуКатегорий",
			МассивПараметров, ,
			"Обновление статистики по категориям");
	КонецЕсли;

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ДобавитьКатегориюВИзбранное();
		
		ДобавитьНовостьБазыЗнаний(1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ДобавитьНовостьБазыЗнаний(3);
КонецПроцедуры
